<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"meta","backend":"1148e243977b06813a2729b994b3bef3356807f282124bfb7d59fb427d3afe7c","plan_job_ref":"Job Pull Request Checks #3655 at https://github.com/GSA-TTS/FAC/actions/runs/10906469113","plan_out_hash":"3ceabe0e0516dffe4bf2ca5a2c6b9d99f3b3a81f8e1bb0bc7ac7a98231589396","plan_hash":"5633c41d29dbfb7d6789e8dd777f63f635e53f38781e390b626345ab42da76b7","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan for __meta__
<details>
<summary>Plan: 9 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.environments["sandbox"].cloudfoundry_service_instance.space_deployer will be created
+   resource "cloudfoundry_service_instance" "space_deployer" {
+       id                             = (known after apply)
+       name                           = "sandbox-deployer"
+       replace_on_params_change       = false
+       replace_on_service_plan_change = false
+       service_plan                   = "238235e1-1ebb-4658-81db-28b2f1375bd6"
+       space                          = (known after apply)
    }

  # module.environments["sandbox"].cloudfoundry_service_key.deployer_creds will be created
+   resource "cloudfoundry_service_key" "deployer_creds" {
+       credentials      = (sensitive value)
+       id               = (known after apply)
+       name             = "sandbox-deployer-key"
+       service_instance = (known after apply)
    }

  # module.environments["sandbox"].cloudfoundry_space.space will be created
+   resource "cloudfoundry_space" "space" {
+       allow_ssh  = true
+       auditors   = (known after apply)
+       developers = (known after apply)
+       id         = (known after apply)
+       managers   = (known after apply)
+       name       = "sandbox"
+       org        = "d030fa77-d07d-4164-8f15-25dbc1c04f44"
    }

  # module.environments["sandbox"].cloudfoundry_space_asgs.space_asgs will be created
+   resource "cloudfoundry_space_asgs" "space_asgs" {
+       id           = (known after apply)
+       running_asgs = [
+           "71d5aa70-fdce-46fa-8494-aabdb8cae381",
+           "c515ab7a-c05a-40c7-b2fe-146a457336a8",
        ]
+       space        = (known after apply)
+       staging_asgs = (known after apply)
    }

  # module.environments["sandbox"].cloudfoundry_space_users.space_permissions will be created
+   resource "cloudfoundry_space_users" "space_permissions" {
+       auditors   = (known after apply)
+       developers = [
+           "alexander.steel@gsa.gov",
+           "anastasia.gradova@gsa.gov",
+           "b0ccedd0-a18e-400d-9cba-89bcbca0638e",
+           "bret.mogilefsky@gsa.gov",
+           "daniel.swick@gsa.gov",
+           "hassandeme.mamasambo@gsa.gov",
+           "james.person@gsa.gov",
+           "matthew.jadud@gsa.gov",
+           "philip.dominguez@gsa.gov",
+           "ranye.mclendon@gsa.gov",
+           "robert.novak@gsa.gov",
+           "sudha.kumar@gsa.gov",
        ]
+       force      = false
+       id         = (known after apply)
+       managers   = [
+           "alexander.steel@gsa.gov",
+           "bret.mogilefsky@gsa.gov",
+           "cfdaac5d-4bb5-4655-98c2-e074374e4347",
+           "daniel.swick@gsa.gov",
+           "matthew.jadud@gsa.gov",
        ]
+       space      = (known after apply)
    }

  # module.environments["sandbox"].local_file.initialization_script will be created
+   resource "local_file" "initialization_script" {
+       content              = <<-EOT
            #!/bin/bash
            # The content of this file is managed by Terraform. If you modify it, it may
            # be reverted the next time Terraform runs. If you want to make changes, do it
            # in ../meta/bootstrap-env/templates.
            
            set -e
            terraform init \
              --backend-config=../shared/config/backend.tfvars \
              --backend-config=key=terraform.tfstate.$(basename $(pwd))
        EOT
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0755"
+       filename             = "./../sandbox/init.sh"
+       id                   = (known after apply)
    }

  # module.environments["sandbox"].local_file.main-tf will be created
+   resource "local_file" "main-tf" {
+       content              = <<-EOT
            # The content of this file is managed by Terraform. If you modify it, it may
            # be reverted the next time Terraform runs. If you want to make changes, do it
            # in ../meta/bootstrap-env/templates.
            
            # Add resources to this module describing what you want in the corresponding 
            # space in cloud.gov. You should probably just reference a shared module as in the
            # example below to keep consistency across spaces, but you can also vary the 
            # content for each environment as needed.
            
            module "sandbox" {
              source        = "../shared/modules/env"
              cf_space_name = "sandbox"
            }
        EOT
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0644"
+       filename             = "./../sandbox/sandbox.tf-example"
+       id                   = (known after apply)
    }

  # module.environments["sandbox"].local_file.providers-tf will be created
+   resource "local_file" "providers-tf" {
+       content              = <<-EOT
            # The content of this file is managed by Terraform. If you modify it, it may
            # be reverted the next time Terraform runs. If you want to make changes, do it
            # in ../meta/bootstrap-env/templates.
            
            terraform {
              required_version = "~> 1.0"
              required_providers {
                cloudfoundry = {
                  source  = "cloudfoundry-community/cloudfoundry"
                  version = "~>0.51.3"
                }
              }
            
              backend "s3" {
                # The rest of the backend parameters must be supplied when you initialize:
                #   terraform init --backend-config=../shared/config/backend.tfvars \
                #    --backend-config=key=terraform.tfstate.$(basename $(pwd))
                #
                # For more info, see:
                # https://developer.hashicorp.com/terraform/language/settings/backends/configuration#partial-configuration
                encrypt = "true"
              }
            }
            
            provider "cloudfoundry" {
              api_url  = "https://api.fr.cloud.gov"
              user     = var.cf_user
              password = var.cf_password
            }
        EOT
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0644"
+       filename             = "./../sandbox/providers-managed.tf"
+       id                   = (known after apply)
    }

  # module.environments["sandbox"].local_file.variables-tf will be created
+   resource "local_file" "variables-tf" {
+       content              = <<-EOT
            # The content of this file is managed by Terraform. If you modify it, it may
            # be reverted the next time Terraform runs. If you want to make changes, do it
            # in ../meta/bootstrap-env/templates.
            
            variable "cf_user" {
              type        = string
              description = "cloud.gov deployer account user"
            }
            
            variable "cf_password" {
              type        = string
              description = "secret; cloud.gov deployer account password"
              sensitive   = true
            }
        EOT
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0644"
+       filename             = "./../sandbox/variables-managed.tf"
+       id                   = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.s3-backups.cloudfoundry_service_instance.bucket,
  on /tmp/terraform-data-dir/modules/s3-backups/s3/main.tf line 14, in resource "cloudfoundry_service_instance" "bucket":
  14:   recursive_delete = var.recursive_delete

Since CF API v3, recursive delete is always done on the cloudcontroller side.
This will be removed in future releases
```
</details>

:memo: Plan generated in [Pull Request Checks #3655](https://github.com/GSA-TTS/FAC/actions/runs/10906469113)